In [1]:
import numpy as np
import pandas as pd

In [3]:
dic={'a':[1,2,4],'b':[2,3,np.nan],'c':[4,np.nan,np.nan]}
df=pd.DataFrame(dic)
df

   a    b    c
0  1  2.0  4.0
1  2  3.0  NaN
2  4  NaN  NaN

In [4]:
df.dropna()

   a    b    c
0  1  2.0  4.0

In [5]:
df.dropna(axis=1)

   a
0  1
1  2
2  4

In [6]:
df.dropna(thresh=2)

   a    b    c
0  1  2.0  4.0
1  2  3.0  NaN

In [10]:
df['b'].fillna(value=df['b'].sum())

0    2.0
1    3.0
2    5.0
Name: b, dtype: float64

In [12]:
#groupby
listnew={'Subject':['Physics','Physics','Maths','Chemistry','Maths','Chemistry'],'Names':['Rahul','Ram','Shyam','Ramesh','Suresh','Kamlesh'],'Scores':[22,23,28,29,44,46]}
df=pd.DataFrame(listnew);
df

     Subject    Names  Scores
0    Physics    Rahul      22
1    Physics      Ram      23
2      Maths    Shyam      28
3  Chemistry   Ramesh      29
4      Maths   Suresh      44
5  Chemistry  Kamlesh      46

In [13]:
df.groupby('Subject')

In [14]:
df['Bonus']=df['Scores']+3
df

     Subject    Names  Scores  Bonus
0    Physics    Rahul      22     25
1    Physics      Ram      23     26
2      Maths    Shyam      28     31
3  Chemistry   Ramesh      29     32
4      Maths   Suresh      44     47
5  Chemistry  Kamlesh      46     49

In [15]:
df.groupby('Subject').sum()

           Scores  Bonus
Subject
Chemistry      75     81
Maths          72     78
Physics        45     51

In [17]:
df.groupby('Subject').std().loc['Chemistry']

Scores    12.020815
Bonus     12.020815
Name: Chemistry, dtype: float64

In [19]:
df.groupby('Subject').max()

            Names  Scores  Bonus
Subject
Chemistry  Ramesh      46     49
Maths      Suresh      44     47
Physics       Ram      23     26

In [20]:
df.groupby('Subject').describe()

          Scores                                                  Bonus        \
           count  mean        std   min    25%   50%    75%   max count  mean
Subject
Chemistry    2.0  37.5  12.020815  29.0  33.25  37.5  41.75  46.0   2.0  40.5
Maths        2.0  36.0  11.313708  28.0  32.00  36.0  40.00  44.0   2.0  39.0
Physics      2.0  22.5   0.707107  22.0  22.25  22.5  22.75  23.0   2.0  25.5


                 std   min    25%   50%    75%   max
Subject
Chemistry  12.020815  32.0  36.25  40.5  44.75  49.0
Maths      11.313708  31.0  35.00  39.0  43.00  47.0
Physics     0.707107  25.0  25.25  25.5  25.75  26.0

In [21]:
#concatination
datatable1={'Name':['Rahul','Ram','Shyam'],'Subject':['Physics','Chemistry','Maths'],'Grade':['A','B','A']}
datatable2={'Name':['Suresh','Ishita','Sam'],'Subject':['Physics','Chemistry','Maths'],'Grade':['A','B','C']}
datatable1

{'Name': ['Rahul', 'Ram', 'Shyam'],
 'Subject': ['Physics', 'Chemistry', 'Maths'],
 'Grade': ['A', 'B', 'A']}

In [22]:
df1=pd.DataFrame(datatable1)

In [23]:
df1

    Name    Subject Grade
0  Rahul    Physics     A
1    Ram  Chemistry     B
2  Shyam      Maths     A

In [24]:
df2=pd.DataFrame(datatable2)
df2

     Name    Subject Grade
0  Suresh    Physics     A
1  Ishita  Chemistry     B
2     Sam      Maths     C

In [26]:
pd.merge(df1,df2,on='Grade')

  Name_x  Subject_x Grade  Name_y  Subject_y
0  Rahul    Physics     A  Suresh    Physics
1  Shyam      Maths     A  Suresh    Physics
2    Ram  Chemistry     B  Ishita  Chemistry

In [27]:
pd.merge(df1,df2,on='Subject')

  Name_x    Subject Grade_x  Name_y Grade_y
0  Rahul    Physics       A  Suresh       A
1    Ram  Chemistry       B  Ishita       B
2  Shyam      Maths       A     Sam       C

In [30]:
pd.merge(df1,df2,how='outer',on='Subject')

  Name_x    Subject Grade_x  Name_y Grade_y
0  Rahul    Physics       A  Suresh       A
1    Ram  Chemistry       B  Ishita       B
2  Shyam      Maths       A     Sam       C

In [47]:
datatable3={'col1':[22,22,23,24,23],'col2':[19,20,21,88,898]}
df3=pd.DataFrame(datatable3)
df3

   col1  col2
0    22    19
1    22    20
2    23    21
3    24    88
4    23   898

df3['col1'].count()

In [48]:
df3['col1'].count()

5

In [49]:
df3['col1'].unique()

array([22, 23, 24], dtype=int64)

In [50]:
df3['col1'].apply(lambda x:x**2)

0    484
1    484
2    529
3    576
4    529
Name: col1, dtype: int64

In [51]:
df3

   col1  col2
0    22    19
1    22    20
2    23    21
3    24    88
4    23   898

In [53]:
df.sort_values(by='col2')

KeyError: 'col2'

In [54]:
#filehandling
pwd

NameError: name 'pwd' is not defined

In [62]:
pd.read_csv("heart.csv")

FileNotFoundError: [Errno 2] No such file or directory: 'heart.csv'

In [63]:
import pandas as pd
import os

In [64]:
pwd

'C:\\Users\\Rahul Awari'

In [65]:
dfnew=pd.read_csv(r"C:\Users\Rahul Awari\test\heart.csv")
dfnew.head()

,Age,Sex,ChestPainType,RestingBP,Cholesterol,FastingBS,RestingECG,MaxHR,ExerciseAngina,Oldpeak,ST_Slope,HeartDisease
0,40,M,ATA,140,289,0,Normal,172,N,0.0,Up,0
1,49,F,NAP,160,180,0,Normal,156,N,1.0,Flat,1
2,37,M,ATA,130,283,0,ST,98,N,0.0,Up,0
3,48,F,ASY,138,214,0,Normal,108,Y,1.5,Flat,1
4,54,M,NAP,150,195,0,Normal,122,N,0.0,Up,0